app/views/post/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 9]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 8], ["post_id", 9], ["LIMIT", 1]]
---

<p>いいね！<%= Like.where(post_id: @post.id).count %></p>

<% if Like.find_by(user_id: @current_user.id,post_id: @post.id) %>