app/views/user/show.html.erb

  <div class="column">
    <% @user.post.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 11]]

    <i class="far fa-heart"></i>
    <%= Like.where(post_id: post.id).count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 11]]

  <div class="column">
    <% as = Like.where(user_id: @user.id) %>
    <% as.each do |a| %>
    <% b = Post.find_by(id: a.post_id) %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 11]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]