app/controllers/application_controller.rb

  def set_current_user
    @current_user = User.find_by(id: session[:user_id])
    if @current_user
      posts_count = Post.where(user_id: @current_user.id)
      posts_count.each do |post_count|
      likes= Like.where(post_id: post_count)
      @like_count = likes.count
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 9]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 10]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 10]]