app/controllers/like_controller.rb

INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 8], ["post_id", 9], ["created_at", "2020-08-21 12:46:11.491431"], ["updated_at", "2020-08-21 12:46:11.491431"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "point" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["point", 1], ["updated_at", "2020-09-05 01:00:32.644968"], ["id", 11]]
---
 def create
  @like = Like.new(user_id: @current_user.id,post_id: params[:post_id])
  @like.save
  @user=User.find_by(id: @current_user.id)
  @user.point += 1
  @user.save