app/controllers/post_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
def ensure_correct_user
  @post = Post.find_by(id: params[:id])

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "投稿９"], ["created_at", "2020-09-01 13:40:22.522177"], ["updated_at", "2020-09-01 13:40:22.522177"], ["user_id", 9]]
UPDATE "users" SET "point" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["point", 0], ["updated_at", "2020-09-04 08:43:01.678083"], ["id", 11]]
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "投稿１１"], ["created_at", "2020-09-04 08:43:01.718011"], ["updated_at", "2020-09-04 08:43:01.718011"], ["user_id", 11]]
---
  def create
    @post = Post.new(content: params[:content],user_id: @current_user.id)
    @user=@post.user
    if @user.point >= 3
      @user.point -= 3
      @user.save
      @post.save