app/controllers/user_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password_digest") VALUES (?, ?, ?, ?, ?, ?)
---
 def create
   @user = User.new(
       name: params[:name],
       email: params[:email],
       password: params[:password],
       image_name: "jisin_app_user.png"
       )
   if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "user9@mail"], ["password_digest", "$2a$12$xcMdOQKDcutX/kuAv4/iZOIaW/6o9o62S2xl6vGXHp2eBYk0L/YkS"], ["updated_at", "2020-09-01 13:03:00.500398"], ["id", 9]]
---
 def update
   @user = User.find_by(id: params[:id])
   @user.name =  params[:name]
   @user.email = params[:email]
   @user.password = params[:password]

   if params[:image]
     @user.image_name = "#{@user.id}.jpg"
     image = params[:image]
     File.binwrite("public/user_images/#{@user.image_name}",image.read)
   end

   if @user.save